---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
source: html/166b28dc-56b8-77a5-b171-c77214a11297.htm
---
# StructuralSectionRectangularBar Members

Creates a new instance of Structural Section Rectangular Bar shape with the associated set of parameters,
 used to attach to structural element.